In [1]:
from sklearn.metrics import mean_squared_error
def compute(model, x, y, x_test, y_test):
    model.fit(x, y)
    y_predict = model.predict(x_test)
    print(mean_squared_error(y_test, y_predict))

In [2]:
import pandas as pd

In [3]:
dataset = pd.read_csv('olympics.csv')

In [4]:
dataset.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [5]:
dataset = dataset.drop(columns='0', axis=1)

In [6]:
dataset.head()

,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [8]:
dataset = dataset.iloc[:, :6]

In [9]:
dataset.head()

          1     2     3     4      5         6
0  № Summer  01 !  02 !  03 !  Total  № Winter
1        13     0     0     2      2         0
2        12     5     2     8     15         3
3        23    18    24    28     70        18
4         5     1     2     9     12         6

In [10]:
dataset = dataset.iloc[:, :5]

In [11]:
dataset.head()

          1     2     3     4      5
0  № Summer  01 !  02 !  03 !  Total
1        13     0     0     2      2
2        12     5     2     8     15
3        23    18    24    28     70
4         5     1     2     9     12

In [12]:
dataset = dataset.iloc[1:]

In [13]:
dataset.head()

    1   2   3   4   5
1  13   0   0   2   2
2  12   5   2   8  15
3  23  18  24  28  70
4   5   1   2   9  12
5   2   3   4   5  12

In [14]:
x = dataset.drop(columns='5', axis=1)

In [15]:
y = dataset['5']

In [16]:
x.head()

    1   2   3   4
1  13   0   0   2
2  12   5   2   8
3  23  18  24  28
4   5   1   2   9
5   2   3   4   5

In [17]:
y.head()

1     2
2    15
3    70
4    12
5    12
Name: 5, dtype: object

In [18]:
from sklearn.linear_model import LinearRegression, SGDRegressor
from sklearn.preprocessing import PolynomialFeatures

In [19]:
model1 = LinearRegression()

In [21]:
model2 = SGDRegressor()

In [22]:
model3 = SGDRegressor(penalty='l1')

In [23]:
model4 = SGDRegressor(penalty='l2')

In [24]:
from sklearn.model_selection import train_test_split

In [25]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.1, random_state=42)

In [28]:
poly1 = PolynomialFeatures(degree=2, include_bias=True)
poly2 = PolynomialFeatures(degree=3, include_bias=True)

In [29]:
x_train_2 = poly1.fit_transform(x_train)
x_test_2 = poly1.transform(x_test)

In [30]:
x_train_3 = poly2.fit_transform(x_train)
x_test_3 = poly2.transform(x_test)

In [31]:
compute(model1, x_train, y_train, x_test, y_test)
compute(model1, x_train_2, y_train, x_test_2, y_test)
compute(model1, x_train_3, y_train, x_test_3, y_test)

5.871543979594962e-26
2.2428732329619143e-24
2.945292797633971e-17

In [32]:
compute(model2, x_train, y_train, x_test, y_test)
compute(model2, x_train_2, y_train, x_test_2, y_test)
compute(model2, x_train_3, y_train, x_test_3, y_test)

1.7130856528986568e+26
4.1497414116434266e+37
9.740759367560131e+53

In [33]:
compute(model3, x_train, y_train, x_test, y_test)
compute(model3, x_train_2, y_train, x_test_2, y_test)
compute(model3, x_train_3, y_train, x_test_3, y_test)

1.0850737576468874e+30
1.787279499372806e+39
8.030211810973979e+46

In [34]:
compute(model4, x_train, y_train, x_test, y_test)
compute(model4, x_train_2, y_train, x_test_2, y_test)
compute(model4, x_train_3, y_train, x_test_3, y_test)

4.267535381585125e+26
2.2237427686023273e+40
1.413696438572491e+52